# <<<< Disclaimer >>>>
#
# This Brewfile is opinionated in the sense that its order/comments do not
# exactly match the output of `brew bundle dump`
#
# Homebrew recommends against hand editing Brewfiles, advising using
# `brew bundle dump` to generate your brewfile
# ref - https://github.com/Homebrew/homebrew-bundle/issues/341#issuecomment-396978468
#
# I like to add comments, set options & reorder things for my own understanding.

# <<<<<<<< taps >>>>>>>>

# default apps
tap "homebrew/core"

# bundle to use `Brewfile`
tap "homebrew/bundle"

# alt
# ref - https://github.com/uptech/alt
tap "uptech/homebrew-oss"

# delta
# ref - https://github.com/dandavison/delta
tap "dandavison/delta", "https://github.com/dandavison/delta"

# <<<<<<<< packages (formulae) >>>>>>>>

# install a modern version of `gcc`
# installed first so that it's used to compile later packages
brew "gcc"

brew "alt"
brew "asciinema"
brew "asdf"
brew "awscli"
brew "bat"
brew "coreutils"
brew "dust"
brew "exa"
brew "exiftool"
brew "fasd"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "gpg"
brew "hub"
brew "hyperfine"
brew "mas"
brew "mdcat"
brew "neovim", args: ["HEAD"]
brew "pandoc"
brew "pastel"
# https://github.com/gpakosz/.tmux#accessing-the-macos-clipboard-from-within-tmux-sessions
brew "reattach-to-user-namespace"
brew "redis"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "shellcheck"
brew "shfmt"
brew "terraform"
brew "tig"
brew "titlecase"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "vim"
brew "watchexec"
brew "wget"
brew "zsh"
