# <<<< Disclaimer >>>>
#
# This Brewfile is opinionated in the sense that its order/comments do not
# exactly match the output of `brew bundle dump`
#
# Homebrew recommends against hand editing Brewfiles, advising using
# `brew bundle dump` to generate your brewfile
# ref - https://github.com/Homebrew/homebrew-bundle/issues/341#issuecomment-396978468
#
# I like to add comments, set options & reorder things for my own understanding.

# <<<<<<<< taps >>>>>>>>

# default apps
tap "homebrew/core"

# bundle to use `Brewfile`
tap "homebrew/bundle"

# `gh` - github CLI (successor to `hub`)
tap "github/gh"

# delta
# ref - https://github.com/dandavison/delta
tap "dandavison/delta", "https://github.com/dandavison/delta"

# <<<<<<<< packages (formulae) >>>>>>>>

brew "asciinema"
brew "asdf"
brew "bandwhich"
brew "bat"
brew "dust"
brew "exa"
brew "exiftool"
brew "fasd"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "github/gh/gh"
brew "git-delta"
brew "gpg"
brew "highlight"
brew "hub"
brew "hyperfine"
brew 'jq'
brew "mdcat"
brew "neovim", args: ["HEAD"]
brew "ncurses"
brew "pastel"
brew "ripgrep"
brew "rsync"
brew "shellcheck"
brew "shfmt"
brew "tig"
brew "titlecase"
brew "tldr"
brew "tmux"
brew "tree"
brew "vim"
brew "watchexec"
brew "zsh"
