# <<<<<<<< casks (only valid on macOS) >>>>>>>>
# see additional context on Brewfiles in $DOTFILES/Brewfile

cask_args appdir: '/Applications'

# drivers (specifically for Logitech)
# ref - https://github.com/Homebrew/homebrew-cask-drivers
tap "homebrew/cask-drivers"

# alternate versions - betas, nightlys, etc.
# ref - https://github.com/Homebrew/homebrew-cask-versions
tap "homebrew/cask-versions"

# <<<< apps >>>>

cask "1password"
cask "alacritty"
cask "alfred"
cask "alt-tab"
cask "backblaze"
cask "bartender"
cask "contexts"
cask "daisydisk"
cask "docker"
cask "fantastical"
cask "firefox"
cask "flux"
cask "folx"
cask "google-backup-and-sync"
cask "google-chrome"
cask "istat-menus"
cask "karabiner-elements"
cask "keycastr"
cask "logitech-options"
cask "marshallofsound-google-play-music-player"
cask "monitorcontrol"
cask "mpv"
cask "notion"
cask "pocket-casts"
cask "postman"
cask "private-internet-access"
cask "rectangle"
cask "slack"
cask "spotify"
cask "sound-control"
cask "subler"
cask "ueli"
cask "visual-studio-code"

# <<<< alternate versions >>>>

cask "firefox-nightly"
