# <<<<<<<< casks (only valid on macOS) >>>>>>>>

cask_args appdir: '/Applications'

# <<<< apps >>>>

cask "1password"
cask "alfred"
cask "alt-tab"
cask "backblaze"
cask "bartender"
cask "contexts"
cask "daisydisk"
cask "fantastical"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "google-backup-and-sync"
cask "istat-menus"
cask "iterm2"
cask "karabiner-elements"
cask "keycastr"
cask "marshallofsound-google-play-music-player"
cask "monitorcontrol"
cask "mpv"
cask "notion"
cask "private-internet-access"
cask "rectangle"
cask "signal"
cask "slack"
cask "spotify"
cask "sound-control"
cask "steermouse"
cask "subler"
cask "tempo"
cask "ueli"
cask "visual-studio-code"
